XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.TXZ3_DFP.pdsc
        <!-- ***********************  Device 'TMPM3H6FUDFG'  ************************* -->
        <device Dname="TMPM3H6FUDFG">
          <processor Dclock="40000000"/>
          <compile header="Device/Include/TMPM3Hx.h" define="TMPM3H6FUDFG"/>
          <debug svd="SVD/M3H6.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x00018000" startup="1" default="1"/>
          <memory id="IRAM1"                           start="0x20000000" size="0x00003000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM3Hx_code_96.FLM"  start="0x00000000" size="0x00018000"             default="1"/>
          <algorithm name="Flash/TMPM3Hx_data_32.FLM"  start="0x30000000" size="0x00008000"             default="1"/>

          <!--book name=""/-->

          <feature type="IOs"           n="87"                          name="I/O Ports (PORT)"/>
          <feature type="ExtInt"        n="16"                          name="External interrupt (INT)"/>
          <feature type="CoreOther"     n="1"                           name="Digital Noise Filter (DNF)"/>
          <feature type="DMA"           n="1"                           name="Direct Memory Access Controllor (DMAC)"/>
          <feature type="Timer"         n="6"      m="32"               name="32bit Timer Event counter (T32A)"/>
          <feature type="RTC"           n="1"      m="32768"            name="Real Time Clock (RTC)"/>
          <feature type="UART"          n="3"                           name="Universal Asynchronous Receiver Transmitter (UART)"/>
          <feature type="I2C"           n="3"                           name="Inter-Integrated Circuit (I2C)"/>
          <feature type="SPI"           n="2"                           name="Toshiba Serial Peripheral Interface (TSPI/SIO)"/>
          <feature type="ADC"           n="16"     m="12"               name="Analog to Digital Converter (ADC)"/>
          <feature type="DAC"           n="2"      m="8"                name="Digital to Analog Converter (DAC)"/>
          <feature type="CoreOther"     n="1"                           name="Advanced Encoder input Circuit (A-ENC)"/>
          <feature type="CoreOther"     n="1"                           name="Programmable Motor Driver Plus (PMD+)"/>
          <feature type="Other"         n="1"                           name="Remote control preprocessor (RMC)"/>
          <feature type="PowerOther"    n="1"                           name="Low-Voltage Detector (LVD)"/>
          <feature type="WDT"           n="1"                           name="Selectable clock Watch dog timer (SIWDT)"/>
          <feature type="Other"         n="1"                           name="Oscillation Frequency Detector (OFD)"/>
          <feature type="PowerOther"    n="1"                           name="Power-on Reset Circuit (POR)"/>
          <feature type="VCC"           n="2.70"   m="5.50"/>
          <feature type="Temp"          n="-40"    m="85"/>
          <feature type="QFP"           n="100"    name="P-QFP100-1420-0.65-001"/>
        </device>

        <!-- ***********************  Device 'TMPM3H6FSDFG'  ************************* -->
        <device Dname="TMPM3H6FSDFG">
          <processor Dclock="40000000"/>
          <compile header="Device/Include/TMPM3Hx.h" define="TMPM3H6FSDFG"/>
          <debug svd="SVD/M3H6.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                           start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM3Hx_code_64.FLM"  start="0x00000000" size="0x00010000"             default="1"/>
          <algorithm name="Flash/TMPM3Hx_data_16.FLM"  start="0x30000000" size="0x00004000"             default="1"/>

          <!--book name=""/-->

          <feature type="IOs"           n="87"                          name="I/O Ports (PORT)"/>
          <feature type="ExtInt"        n="16"                          name="External interrupt (INT)"/>
          <feature type="CoreOther"     n="1"                           name="Digital Noise Filter (DNF)"/>
          <feature type="DMA"           n="1"                           name="Direct Memory Access Controllor (DMAC)"/>
          <feature type="Timer"         n="6"      m="32"               name="32bit Timer Event counter (T32A)"/>
          <feature type="RTC"           n="1"      m="32768"            name="Real Time Clock (RTC)"/>
          <feature type="UART"          n="3"                           name="Universal Asynchronous Receiver Transmitter (UART)"/>
          <feature type="I2C"           n="3"                           name="Inter-Integrated Circuit (I2C)"/>
          <feature type="SPI"           n="2"                           name="Toshiba Serial Peripheral Interface (TSPI/SIO)"/>
          <feature type="ADC"           n="16"     m="12"               name="Analog to Digital Converter (ADC)"/>
          <feature type="DAC"           n="2"      m="8"                name="Digital to Analog Converter (DAC)"/>
          <feature type="CoreOther"     n="1"                           name="Advanced Encoder input Circuit (A-ENC)"/>
          <feature type="CoreOther"     n="1"                           name="Programmable Motor Driver Plus (PMD+)"/>
          <feature type="Other"         n="1"                           name="Remote control preprocessor (RMC)"/>
          <feature type="PowerOther"    n="1"                           name="Low-Voltage Detector (LVD)"/>
          <feature type="WDT"           n="1"                           name="Selectable clock Watch dog timer (SIWDT)"/>
          <feature type="Other"         n="1"                           name="Oscillation Frequency Detector (OFD)"/>
          <feature type="PowerOther"    n="1"                           name="Power-on Reset Circuit (POR)"/>
          <feature type="VCC"           n="2.70"   m="5.50"/>
          <feature type="Temp"          n="-40"    m="85"/>
          <feature type="QFP"           n="100"    name="P-QFP100-1420-0.65-001"/>
        </device>

        <!-- ***********************  Device 'TMPM3H5FWFG'  ************************* -->
        <device Dname="TMPM3H5FWFG">
          <processor Dclock="40000000"/>
          <compile header="Device/Include/TMPM3Hx.h" define="TMPM3H5FWFG"/>
          <debug svd="SVD/M3H5.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                           start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM3Hx_code_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>
          <algorithm name="Flash/TMPM3Hx_data_32.FLM"  start="0x30000000" size="0x00008000"             default="1"/>

          <!--book name=""/-->

          <feature type="IOs"           n="67"                          name="I/O Ports (PORT)"/>
          <feature type="ExtInt"        n="15"                          name="External interrupt (INT)"/>
          <feature type="CoreOther"     n="1"                           name="Digital Noise Filter (DNF)"/>
          <feature type="DMA"           n="1"                           name="Direct Memory Access Controllor (DMAC)"/>
          <feature type="Timer"         n="6"      m="32"               name="32bit Timer Event counter (T32A)"/>
          <feature type="RTC"           n="1"      m="32768"            name="Real Time Clock (RTC)"/>
          <feature type="UART"          n="3"                           name="Universal Asynchronous Receiver Transmitter (UART)"/>
          <feature type="I2C"           n="3"                           name="Inter-Integrated Circuit (I2C)"/>
          <feature type="SPI"           n="2"                           name="Toshiba Serial Peripheral Interface (TSPI/SIO)"/>
          <feature type="ADC"           n="10"     m="12"               name="Analog to Digital Converter (ADC)"/>
          <feature type="DAC"           n="2"      m="8"                name="Digital to Analog Converter (DAC)"/>
          <feature type="CoreOther"     n="1"                           name="Advanced Encoder input Circuit (A-ENC)"/>
          <feature type="CoreOther"     n="1"                           name="Programmable Motor Driver Plus (PMD+)"/>
          <feature type="Other"         n="1"                           name="Remote control preprocessor (RMC)"/>
          <feature type="PowerOther"    n="1"                           name="Low-Voltage Detector (LVD)"/>
          <feature type="WDT"           n="1"                           name="Selectable clock Watch dog timer (SIWDT)"/>
          <feature type="Other"         n="1"                           name="Oscillation Frequency Detector (OFD)"/>
          <feature type="PowerOther"    n="1"                           name="Power-on Reset Circuit (POR)"/>
          <feature type="VCC"           n="2.70"   m="5.50"/>
          <feature type="Temp"          n="-40"    m="85"/>
          <feature type="QFP"          n="80"    name="LQFP80-P-1212-0.50F"/>
        </device>

        <!-- ***********************  Device 'TMPM3H5FUFG'  ************************* -->
        <device Dname="TMPM3H5FUFG">
          <processor Dclock="40000000"/>
          <compile header="Device/Include/TMPM3Hx.h" define="TMPM3H5FUFG"/>
          <debug svd="SVD/M3H5.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x00018000" startup="1" default="1"/>
          <memory id="IRAM1"                           start="0x20000000" size="0x00003000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM3Hx_code_96.FLM"  start="0x00000000" size="0x00018000"             default="1"/>
          <algorithm name="Flash/TMPM3Hx_data_32.FLM"  start="0x30000000" size="0x00008000"             default="1"/>

          <!--book name=""/-->

          <feature type="IOs"           n="67"                          name="I/O Ports (PORT)"/>
          <feature type="ExtInt"        n="15"                          name="External interrupt (INT)"/>
          <feature type="CoreOther"     n="1"                           name="Digital Noise Filter (DNF)"/>
          <feature type="DMA"           n="1"                           name="Direct Memory Access Controllor (DMAC)"/>
          <feature type="Timer"         n="6"      m="32"               name="32bit Timer Event counter (T32A)"/>
          <feature type="RTC"           n="1"      m="32768"            name="Real Time Clock (RTC)"/>
          <feature type="UART"          n="3"                           name="Universal Asynchronous Receiver Transmitter (UART)"/>
          <feature type="I2C"           n="3"                           name="Inter-Integrated Circuit (I2C)"/>
          <feature type="SPI"           n="2"                           name="Toshiba Serial Peripheral Interface (TSPI/SIO)"/>
          <feature type="ADC"           n="10"     m="12"               name="Analog to Digital Converter (ADC)"/>
          <feature type="DAC"           n="2"      m="8"                name="Digital to Analog Converter (DAC)"/>
          <feature type="CoreOther"     n="1"                           name="Advanced Encoder input Circuit (A-ENC)"/>
          <feature type="CoreOther"     n="1"                           name="Programmable Motor Driver Plus (PMD+)"/>
          <feature type="Other"         n="1"                           name="Remote control preprocessor (RMC)"/>
          <feature type="PowerOther"    n="1"                           name="Low-Voltage Detector (LVD)"/>
          <feature type="WDT"           n="1"                           name="Selectable clock Watch dog timer (SIWDT)"/>
          <feature type="Other"         n="1"                           name="Oscillation Frequency Detector (OFD)"/>
          <feature type="PowerOther"    n="1"                           name="Power-on Reset Circuit (POR)"/>
          <feature type="VCC"           n="2.70"   m="5.50"/>
          <feature type="Temp"          n="-40"    m="85"/>
          <feature type="QFP"          n="80"    name="LQFP80-P-1212-0.50F"/>
        </device>

