XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.TXZ3_DFP.pdsc
        <!-- ***********************  Device 'TMPM3HMFDFG'  ************************* -->
        <device Dname="TMPM3HMFDFG">
          <processor Dclock="80000000"/>
          <compile header="Device/Include/TMPM3Hy.h" define="TMPM3HMFDFG"/>
          <debug svd="SVD/M3HM.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                           start="0x20000000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM3Hx_code_512.FLM" start="0x00000000" size="0x00080000"             default="1"/>
          <algorithm name="Flash/TMPM3Hx_data_32.FLM"  start="0x30000000" size="0x00004000"             default="1"/>

          <!--book name=""/-->

          <feature type="IOs"           n="72"                          name="I/O Ports (PORT)"/>
          <feature type="ExtInt"        n="15"                          name="External interrupt"/>
          <feature type="CoreOther"     n="1"                           name="Digital Noise Filter (DNF)"/>
          <feature type="DMA"           n="2"                           name="DMAC"/>
          <feature type="Timer"         n="8"      m="32"               name="32bit Timer Event counter (T32A)"/>
          <feature type="RTC"           n="1"      m="32768"/>
          <feature type="UART"          n="6"                           name="Universal Asynchronous Receiver Transmitter (UART)"/>
          <feature type="I2C"           n="3"                           name="Inter-Integrated Circuit (I2C)"/>
          <feature type="SPI"           n="4"                           name="Toshiba Serial Peripheral Interface (TSPI/SIO)"/>
          <feature type="ADC"           n="10"     m="12"               name="Analog to Digital Converter (ADC)"/>
          <feature type="DAC"           n="2"      m="8"                name="Digital to Analog Converter (DAC)"/>
          <feature type="AnalogOther"   n="1"                           name="Comparator (Comp)"/>
          <feature type="CoreOther"     n="1"                           name="Advanced Encoder input Circuit (A-ENC)"/>
          <feature type="CoreOther"     n="1"                           name="Advanst Programmable Motor Driver (A-PMD)"/>
          <feature type="Other"         n="1"                           name="Remote control preprocessor (RMC)"/>
          <feature type="Other"         n="1"                           name="Cyclic Redundancy Check (CRC)"/>
          <feature type="PowerOther"    n="1"                           name="Low-Voltage Detector (LVD)"/>
          <feature type="WDT"           n="1"                           name="Selectable clock Watch dog timer (SIWDT)"/>
          <feature type="Other"         n="1"                           name="Oscillation Frequency Detector (OFD)"/>
          <feature type="PowerOther"    n="1"                           name="Power-on Reset Circuit (POR)"/>
          <feature type="VCC"           n="2.70"   m="5.50"/>
          <feature type="Temp"          n="-40"    m="85"/>
          <feature type="QFP"          n="80"    name="P-LQFP80-1212-0.50-003"/>
        </device>

        <!-- ***********************  Device 'TMPM3HMFZFG'  ************************* -->
        <device Dname="TMPM3HMFZFG">
          <processor Dclock="80000000"/>
          <compile header="Device/Include/TMPM3Hy.h" define="TMPM3HMFZFG"/>
          <debug svd="SVD/M3HM.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x00060000" startup="1" default="1"/>
          <memory id="IRAM1"                           start="0x20000000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM3Hx_code_384.FLM" start="0x00000000" size="0x00060000"             default="1"/>
          <algorithm name="Flash/TMPM3Hx_data_32.FLM"  start="0x30000000" size="0x00004000"             default="1"/>

          <!--book name=""/-->

          <feature type="IOs"           n="72"                          name="I/O Ports (PORT)"/>
          <feature type="ExtInt"        n="15"                          name="External interrupt"/>
          <feature type="CoreOther"     n="1"                           name="Digital Noise Filter (DNF)"/>
          <feature type="DMA"           n="2"                           name="DMAC"/>
          <feature type="Timer"         n="8"      m="32"               name="32bit Timer Event counter (T32A)"/>
          <feature type="RTC"           n="1"      m="32768"/>
          <feature type="UART"          n="6"                           name="Universal Asynchronous Receiver Transmitter (UART)"/>
          <feature type="I2C"           n="3"                           name="Inter-Integrated Circuit (I2C)"/>
          <feature type="SPI"           n="4"                           name="Toshiba Serial Peripheral Interface (TSPI/SIO)"/>
          <feature type="ADC"           n="10"     m="12"               name="Analog to Digital Converter (ADC)"/>
          <feature type="DAC"           n="2"      m="8"                name="Digital to Analog Converter (DAC)"/>
          <feature type="AnalogOther"   n="1"                           name="Comparator (Comp)"/>
          <feature type="CoreOther"     n="1"                           name="Advanced Encoder input Circuit (A-ENC)"/>
          <feature type="CoreOther"     n="1"                           name="Advanst Programmable Motor Driver (A-PMD)"/>
          <feature type="Other"         n="1"                           name="Remote control preprocessor (RMC)"/>
          <feature type="Other"         n="1"                           name="Cyclic Redundancy Check (CRC)"/>
          <feature type="PowerOther"    n="1"                           name="Low-Voltage Detector (LVD)"/>
          <feature type="WDT"           n="1"                           name="Selectable clock Watch dog timer (SIWDT)"/>
          <feature type="Other"         n="1"                           name="Oscillation Frequency Detector (OFD)"/>
          <feature type="PowerOther"    n="1"                           name="Power-on Reset Circuit (POR)"/>
          <feature type="VCC"           n="2.70"   m="5.50"/>
          <feature type="Temp"          n="-40"    m="85"/>
          <feature type="QFP"          n="80"    name="P-LQFP80-1212-0.50-003"/>
        </device>

